1) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:128    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function reset(Request $request, UserPasswordHasherInterface $passwordHasher, TranslatorInterface $translator, string $token = null) : Response
     {
         if ($token) {
-            // We store the token in session and remove it from the URL, to avoid the URL being
-            // loaded in a browser and potentially leaking the token to 3rd party JavaScript.
-            /**
-             * @codeCoverageIgnore
-             */
-            $this->storeTokenInSession($token);
+            
             return $this->redirectToRoute('app_reset_password');
         }
         $token = $this->getTokenFromSessionWrapper();

2) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:153    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         // The token is valid; allow the user to change their password.
         $form = $this->createForm(ChangePasswordFormType::class);
-        $form->handleRequest($request);
+        
         if ($form->isSubmitted() && $form->isValid()) {
             // A password reset token should be used only once, remove it.
             $this->resetPasswordHelper->removeResetRequest($token);

4) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:158    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form = $this->createForm(ChangePasswordFormType::class);
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
-            // A password reset token should be used only once, remove it.
-            $this->resetPasswordHelper->removeResetRequest($token);
+            
             // $this->resetPasswordHelper->removeResetRequest($token);
             // Encode(hash) the plain password, and set it.
             $encodedPassword = $passwordHasher->hashPassword($user, $form->get('plainPassword')->getData());

5) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:168    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // $this->resetPasswordHelper->removeResetRequest($token);
             // Encode(hash) the plain password, and set it.
             $encodedPassword = $passwordHasher->hashPassword($user, $form->get('plainPassword')->getData());
-            $user->setPassword($encodedPassword);
+            
             $this->entityManager->flush();
             // The session is cleaned up after the password has been changed.
             $this->cleanSessionAfterReset();

6) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:169    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // Encode(hash) the plain password, and set it.
             $encodedPassword = $passwordHasher->hashPassword($user, $form->get('plainPassword')->getData());
             $user->setPassword($encodedPassword);
-            $this->entityManager->flush();
+            
             // The session is cleaned up after the password has been changed.
             $this->cleanSessionAfterReset();
             // add flash message

7) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:172    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $encodedPassword = $passwordHasher->hashPassword($user, $form->get('plainPassword')->getData());
             $user->setPassword($encodedPassword);
             $this->entityManager->flush();
-            // The session is cleaned up after the password has been changed.
-            $this->cleanSessionAfterReset();
+            
             // add flash message
             $this->addFlash('success', 'Votre mot de passe a été modifié avec succès.');
             return $this->redirectToRoute('app_home');

8) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:175    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->entityManager->flush();
             // The session is cleaned up after the password has been changed.
             $this->cleanSessionAfterReset();
-            // add flash message
-            $this->addFlash('success', 'Votre mot de passe a été modifié avec succès.');
+            
             return $this->redirectToRoute('app_home');
         }
         return $this->render('reset_password/reset.html.twig', ['resetForm' => $form->createView()]);

9) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:179    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->addFlash('success', 'Votre mot de passe a été modifié avec succès.');
             return $this->redirectToRoute('app_home');
         }
-        return $this->render('reset_password/reset.html.twig', ['resetForm' => $form->createView()]);
+        return $this->render('reset_password/reset.html.twig', []);
     }
     public function getUserfromEmail(string $email)
     {

10) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:180    [M] ArrayItem

--- Original
+++ New
@@ @@
             $this->addFlash('success', 'Votre mot de passe a été modifié avec succès.');
             return $this->redirectToRoute('app_home');
         }
-        return $this->render('reset_password/reset.html.twig', ['resetForm' => $form->createView()]);
+        return $this->render('reset_password/reset.html.twig', ['resetForm' > $form->createView()]);
     }
     public function getUserfromEmail(string $email)
     {

40) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('plainPassword', RepeatedType::class, [
             'type' => PasswordType::class,
             'options' => ['attr' => ['autocomplete' => 'new-password', 'class' => 'form-control m-2 p-2']],
-            'first_options' => ['constraints' => [new NotBlank(['message' => 'Please enter a password']), new Length([
-                'min' => 6,
-                'minMessage' => 'Your password should be at least {{ limit }} characters',
-                // max length allowed by Symfony for security reasons
-                'max' => 4096,
-            ])], 'label' => 'New password'],
+            'first_options' => ['label' => 'New password'],
             'second_options' => ['label' => 'Repeat Password'],
             'invalid_message' => 'The password fields must match.',
             // Instead of being set onto the object directly,

41) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('plainPassword', RepeatedType::class, [
             'type' => PasswordType::class,
             'options' => ['attr' => ['autocomplete' => 'new-password', 'class' => 'form-control m-2 p-2']],
-            'first_options' => ['constraints' => [new NotBlank(['message' => 'Please enter a password']), new Length([
+            'first_options' => ['constraints' => [new Length([
                 'min' => 6,
                 'minMessage' => 'Your password should be at least {{ limit }} characters',
                 // max length allowed by Symfony for security reasons

42) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $builder->add('plainPassword', RepeatedType::class, [
             'type' => PasswordType::class,
             'options' => ['attr' => ['autocomplete' => 'new-password', 'class' => 'form-control m-2 p-2']],
-            'first_options' => ['constraints' => [new NotBlank(['message' => 'Please enter a password']), new Length([
+            'first_options' => ['constraints' => [new NotBlank([]), new Length([
                 'min' => 6,
                 'minMessage' => 'Your password should be at least {{ limit }} characters',
                 // max length allowed by Symfony for security reasons

44) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:32    [M] DecrementInteger

--- Original
+++ New
@@ @@
             'type' => PasswordType::class,
             'options' => ['attr' => ['autocomplete' => 'new-password', 'class' => 'form-control m-2 p-2']],
             'first_options' => ['constraints' => [new NotBlank(['message' => 'Please enter a password']), new Length([
-                'min' => 6,
+                'min' => 5,
                 'minMessage' => 'Your password should be at least {{ limit }} characters',
                 // max length allowed by Symfony for security reasons
                 'max' => 4096,

45) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:32    [M] IncrementInteger

--- Original
+++ New
@@ @@
             'type' => PasswordType::class,
             'options' => ['attr' => ['autocomplete' => 'new-password', 'class' => 'form-control m-2 p-2']],
             'first_options' => ['constraints' => [new NotBlank(['message' => 'Please enter a password']), new Length([
-                'min' => 6,
+                'min' => 7,
                 'minMessage' => 'Your password should be at least {{ limit }} characters',
                 // max length allowed by Symfony for security reasons
                 'max' => 4096,

46) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:35    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 'min' => 6,
                 'minMessage' => 'Your password should be at least {{ limit }} characters',
                 // max length allowed by Symfony for security reasons
-                'max' => 4096,
+                'max' => 4095,
             ])], 'label' => 'New password'],
             'second_options' => ['label' => 'Repeat Password'],
             'invalid_message' => 'The password fields must match.',

47) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:35    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 'min' => 6,
                 'minMessage' => 'Your password should be at least {{ limit }} characters',
                 // max length allowed by Symfony for security reasons
-                'max' => 4096,
+                'max' => 4097,
             ])], 'label' => 'New password'],
             'second_options' => ['label' => 'Repeat Password'],
             'invalid_message' => 'The password fields must match.',

48) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:40    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 // max length allowed by Symfony for security reasons
                 'max' => 4096,
             ])], 'label' => 'New password'],
-            'second_options' => ['label' => 'Repeat Password'],
+            'second_options' => [],
             'invalid_message' => 'The password fields must match.',
             // Instead of being set onto the object directly,
             // this is read and encoded in the controller

49) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:46    [M] FalseValue

--- Original
+++ New
@@ @@
             'invalid_message' => 'The password fields must match.',
             // Instead of being set onto the object directly,
             // this is read and encoded in the controller
-            'mapped' => false,
+            'mapped' => true,
         ]);
     }
     public function configureOptions(OptionsResolver $resolver) : void

50) C:\laragon\www\p8-todo-from-scratch\src\Form\ChangePasswordFormType.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults([]);
+        
     }
 }


Timed Out mutants:
==================

13) C:\laragon\www\p8-todo-from-scratch\src\Controller\ResetPasswordController.php:91    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     /**
      * @codeCoverageIgnore
      */
-    protected function getTokenFromSessionWrapper()
+    private function getTokenFromSessionWrapper()
     {
         return $this->getTokenFromSession();
     }

14) C:\laragon\www\p8-todo-from-scratch\src\Controller\SecurityController.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * 
      * @codeCoverageIgnore
      */
-    public function logout() : void
+    protected function logout() : void
     {
     }
 }

15) C:\laragon\www\p8-todo-from-scratch\src\Security\EmailVerifier.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(private VerifyEmailHelperInterface $verifyEmailHelper, private MailerInterface $mailer, private EntityManagerInterface $entityManager)
     {
     }
-    public function sendEmailConfirmation(string $verifyEmailRouteName, UserInterface $user, TemplatedEmail $email) : void
+    protected function sendEmailConfirmation(string $verifyEmailRouteName, UserInterface $user, TemplatedEmail $email) : void
     {
         $signatureComponents = $this->verifyEmailHelper->generateSignature($verifyEmailRouteName, $user->getId(), $user->getEmail());
         $context = $email->getContext();

16) C:\laragon\www\p8-todo-from-scratch\src\Security\EmailVerifier.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $context['signedUrl'] = $signatureComponents->getSignedUrl();
         $context['expiresAtMessageKey'] = $signatureComponents->getExpirationMessageKey();
         $context['expiresAtMessageData'] = $signatureComponents->getExpirationMessageData();
-        $email->context($context);
+        
         $this->mailer->send($email);
     }
     /**

17) C:\laragon\www\p8-todo-from-scratch\src\Security\EmailVerifier.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $context['expiresAtMessageKey'] = $signatureComponents->getExpirationMessageKey();
         $context['expiresAtMessageData'] = $signatureComponents->getExpirationMessageData();
         $email->context($context);
-        $this->mailer->send($email);
+        
     }
     /**
      * @throws VerifyEmailExceptionInterface

18) C:\laragon\www\p8-todo-from-scratch\src\Service\DecoratedResetPasswordHelper.php:20    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @codeCoverageIgnore
      */
-    public function generateFakeResetToken()
+    protected function generateFakeResetToken()
     {
         // If you want to override or add behavior, do it here.
         // For now, let's just delegate to the original implementation:

19) C:\laragon\www\p8-todo-from-scratch\src\Service\DecoratedResetPasswordHelper.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function removeResetRequest(string $fullToken) : void
     {
-        $this->delegate->removeResetRequest($fullToken);
+        
     }
     /**
      * @codeCoverageIgnore
